In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("car_sales_india.csv")

In [10]:
df.head()

,Sale ID,Date,Car Brand,Car Model,Fuel Type,Transmission,Price (INR),City,Seller Type,Year of Manufacture,Mileage (km/l),Engine Capacity (cc)
0,1,2023-07-28,Honda,Amaze,Electric,Automatic,2636520,Chennai,Individual,2018,19.6,1200
1,2,2023-07-30,Mahindra,Thar,Diesel,Manual,1067639,Mumbai,Dealer,2022,17.3,1500
2,3,2023-07-30,Honda,City,Electric,Automatic,2832014,Bangalore,Dealer,2019,13.6,1000
3,4,2023-02-12,Tata,Tiago,Electric,Automatic,2636617,Mumbai,Individual,2016,16.3,1200
4,5,2023-02-27,Honda,Amaze,Electric,Manual,2501019,Delhi,Dealer,2022,21.1,1000

In [4]:
df.head(10)

,Sale ID,Date,Car Brand,Car Model,Fuel Type,Transmission,Price (INR),City,Seller Type,Year of Manufacture,Mileage (km/l),Engine Capacity (cc)
0,1,2023-07-28,Honda,Amaze,Electric,Automatic,2636520,Chennai,Individual,2018,19.6,1200
1,2,2023-07-30,Mahindra,Thar,Diesel,Manual,1067639,Mumbai,Dealer,2022,17.3,1500
2,3,2023-07-30,Honda,City,Electric,Automatic,2832014,Bangalore,Dealer,2019,13.6,1000
3,4,2023-02-12,Tata,Tiago,Electric,Automatic,2636617,Mumbai,Individual,2016,16.3,1200
4,5,2023-02-27,Honda,Amaze,Electric,Manual,2501019,Delhi,Dealer,2022,21.1,1000
5,6,2023-09-12,Honda,City,Diesel,Manual,2522517,Bangalore,Dealer,2020,21.2,1500
6,7,2023-04-09,Honda,Amaze,Electric,Automatic,1763668,Delhi,Dealer,2023,22.6,2000
7,8,2023-01-24,Hyundai,i10,Electric,Manual,781014,Mumbai,Individual,2016,10.6,2500
8,9,2023-07-07,Honda,Jazz,Petrol,Automatic,333902,Delhi,Dealer,2020,11.2,2000
9,10,2023-01-24,Mahindra,Scorpio,Electric,Automatic,690609,Delhi,Dealer,2020,11.0,1800

In [5]:
df.tail()

,Sale ID,Date,Car Brand,Car Model,Fuel Type,Transmission,Price (INR),City,Seller Type,Year of Manufacture,Mileage (km/l),Engine Capacity (cc)
495,496,2023-12-03,Hyundai,Verna,CNG,Automatic,1798782,Mumbai,Dealer,2020,23.4,1500
496,497,2023-01-13,Hyundai,i10,Petrol,Automatic,505073,Hyderabad,Dealer,2016,11.1,1800
497,498,2023-03-12,Tata,Harrier,Electric,Automatic,1459012,Hyderabad,Dealer,2015,12.7,1200
498,499,2023-12-21,Hyundai,Creta,Petrol,Automatic,2512166,Hyderabad,Individual,2020,13.1,1800
499,500,2023-11-20,Maruti,Dzire,Electric,Automatic,977102,Hyderabad,Dealer,2016,13.3,1800

In [ ]:
df.shape # rows x col

(500, 12)

In [ ]:
df.columns  # get col with name

Index(['Sale ID', 'Date', 'Car Brand', 'Car Model', 'Fuel Type',
       'Transmission', 'Price (INR)', 'City', 'Seller Type',
       'Year of Manufacture', 'Mileage (km/l)', 'Engine Capacity (cc)'],
      dtype='object')

In [ ]:
df.describe()   # gives statistical data

,Sale ID,Price (INR),Year of Manufacture,Mileage (km/l),Engine Capacity (cc)
count,500.000000,5.000000e+02,500.000000,500.000000,500.00000
mean,250.500000,1.715120e+06,2019.066000,17.303400,1671.60000
std,144.481833,8.084176e+05,2.622097,4.250805,502.25288
min,1.000000,3.065960e+05,2015.000000,10.000000,1000.00000
25%,125.750000,9.786890e+05,2017.000000,13.500000,1200.00000
50%,250.500000,1.765048e+06,2019.000000,17.200000,1500.00000
75%,375.250000,2.465958e+06,2021.000000,21.100000,2000.00000
max,500.000000,2.998496e+06,2023.000000,25.000000,2500.00000

In [ ]:
df.info()  # Data about data(Metadata)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Sale ID               500 non-null    int64
 1   Date                  500 non-null    object
 2   Car Brand             500 non-null    object
 3   Car Model             500 non-null    object
 4   Fuel Type             500 non-null    object
 5   Transmission          500 non-null    object
 6   Price (INR)           500 non-null    int64
 7   City                  500 non-null    object
 8   Seller Type           500 non-null    object
 9   Year of Manufacture   500 non-null    int64
 10  Mileage (km/l)        500 non-null    float64
 11  Engine Capacity (cc)  500 non-null    int64
dtypes: float64(1), int64(4), object(7)
memory usage: 47.0+ KB

In [4]:
print(df[["Car Brand","City"]])

    Car Brand       City
0       Honda    Chennai
1    Mahindra     Mumbai
2       Honda  Bangalore
3        Tata     Mumbai
4       Honda      Delhi
..        ...        ...
495   Hyundai     Mumbai
496   Hyundai  Hyderabad
497      Tata  Hyderabad
498   Hyundai  Hyderabad
499    Maruti  Hyderabad

[500 rows x 2 columns]

- ##  Employee attendance and leave tracker Project using Pandas

In [2]:
import numpy as np
import pandas as pd

In [11]:
df= pd.read_csv("employee_attendance_leave_tracker_large.csv")

In [7]:
df

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
0,EMP00075,01/13/2024,Finance,Other,Intern,Mumbai,Present,8:51:00,16:19:00,7.466667,NaN,0.000000,Night,15000,4
1,EMP00411,02/26/2024,Support,Male,Executive,Bangalore,Present,8:45:00,16:57:00,8.200000,NaN,0.000000,Afternoon,50000,1
2,EMP00379,02/19/2024,Support,Male,Intern,Pune,Absent,NaN,NaN,0.000000,NaN,0.000000,Morning,15000,1
3,EMP00673,01/01/2024,HR,Other,Consultant,Chennai,Present,10:03:00,17:09:00,7.100000,NaN,0.000000,Morning,65000,3
4,EMP00758,02/23/2024,Marketing,Male,Intern,Delhi,Present,10:02:00,18:47:00,8.750000,NaN,0.000000,Afternoon,15000,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,EMP00121,02/16/2024,IT,Other,Intern,Hyderabad,Present,9:10:00,16:30:00,7.333333,NaN,0.000000,Night,15000,2
49996,EMP00729,01/22/2024,Sales,Male,Consultant,Chennai,Present,9:08:00,17:03:00,7.916667,NaN,0.000000,Afternoon,65000,4
49997,EMP00194,03/14/2024,Sales,Male,Manager,Bangalore,Present,10:06:00,17:47:00,7.683333,NaN,0.000000,Afternoon,70000,1
49998,EMP00311,02/25/2024,Sales,Other,Developer,Delhi,Present,9:04:00,18:15:00,9.183333,NaN,0.183333,Night,60000,4
49999,EMP00672,02/01/2024,HR,Other,Intern,Kolkata,Present,9:14:00,17:17:00,8.050000,NaN,0.000000,Morning,15000,2

In [8]:
df.shape

(50000, 15)

In [10]:
df.columns

Index(['Employee_ID', 'Date', 'Department', 'Gender', 'Job_Role', 'Location',
       'Status', 'CheckIn', 'CheckOut', 'Work_Hours', 'Leave_Type',
       'Overtime_Hours', 'Shift', 'Base_Salary', 'Performance_Rating'],
      dtype='object')

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         50000 non-null  object
 1   Date                50000 non-null  object
 2   Department          50000 non-null  object
 3   Gender              50000 non-null  object
 4   Job_Role            50000 non-null  object
 5   Location            50000 non-null  object
 6   Status              50000 non-null  object
 7   CheckIn             41548 non-null  object
 8   CheckOut            41548 non-null  object
 9   Work_Hours          50000 non-null  float64
 10  Leave_Type          3465 non-null   object
 11  Overtime_Hours      50000 non-null  float64
 12  Shift               50000 non-null  object
 13  Base_Salary         50000 non-null  int64
 14  Performance_Rating  50000 non-null  int64
dtypes: float64(2), int64(2), object(11)
memory usage: 5.7+ MB

In [14]:
df.describe()

         Work_Hours  Overtime_Hours   Base_Salary  Performance_Rating
count  50000.000000    50000.000000  50000.000000        50000.000000
mean       6.916229        0.210836  50005.800000            2.996780
std        3.390522        0.440811  18449.167293            1.414259
min        0.000000        0.000000  15000.000000            1.000000
25%        6.716667        0.000000  40000.000000            2.000000
50%        8.083333        0.000000  50000.000000            3.000000
75%        9.116667        0.116667  65000.000000            4.000000
max       11.233333        2.233333  70000.000000            5.000000

In [17]:
df.isnull()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
0,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,True,True,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
49996,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
49997,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
49998,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
49999,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False

In [ ]:
df.isnull().sum()  # gives us the total number of the null values in the columns

Employee_ID               0
Date                      0
Department                0
Gender                    0
Job_Role                  0
Location                  0
Status                    0
CheckIn                8452
CheckOut               8452
Work_Hours                0
Leave_Type            46535
Overtime_Hours            0
Shift                     0
Base_Salary               0
Performance_Rating        0
dtype: int64

In [19]:
df["Department"].head(10)

0      Finance
1      Support
2      Support
3           HR
4    Marketing
5    Marketing
6    Marketing
7          R&D
8    Marketing
9           HR
Name: Department, dtype: object

In [ ]:
df[["Work_Hours","Base_Salary"]].head(10) # Fetching two columns

   Work_Hours  Base_Salary
0    7.466667        15000
1    8.200000        50000
2    0.000000        15000
3    7.100000        65000
4    8.750000        15000
5   10.633333        70000
6    9.533333        70000
7    9.833333        15000
8    0.000000        60000
9    6.683333        15000

In [26]:
df[df["Base_Salary"]> 30000].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
1,EMP00411,02/26/2024,Support,Male,Executive,Bangalore,Present,8:45:00,16:57:00,8.200000,NaN,0.000000,Afternoon,50000,1
3,EMP00673,01/01/2024,HR,Other,Consultant,Chennai,Present,10:03:00,17:09:00,7.100000,NaN,0.000000,Morning,65000,3
5,EMP00775,02/07/2024,Marketing,Male,Manager,Bangalore,Work From Home,8:35:00,19:13:00,10.633333,NaN,1.633333,Morning,70000,4
6,EMP00215,03/13/2024,Marketing,Female,Manager,Mumbai,Present,9:41:00,19:13:00,9.533333,NaN,0.533333,Night,70000,4
8,EMP00261,01/14/2024,Marketing,Male,Developer,Hyderabad,On Leave,NaN,NaN,0.000000,Paternity Leave,0.000000,Afternoon,60000,2

In [28]:
df[df["Base_Salary"] == 70000].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
5,EMP00775,02/07/2024,Marketing,Male,Manager,Bangalore,Work From Home,8:35:00,19:13:00,10.633333,NaN,1.633333,Morning,70000,4
6,EMP00215,03/13/2024,Marketing,Female,Manager,Mumbai,Present,9:41:00,19:13:00,9.533333,NaN,0.533333,Night,70000,4
18,EMP00582,01/09/2024,Operations,Male,Manager,Chennai,Work From Home,9:48:00,16:42:00,6.900000,NaN,0.000000,Morning,70000,3
25,EMP00604,01/30/2024,Marketing,Other,Manager,Bangalore,Present,8:52:00,16:43:00,7.850000,NaN,0.000000,Afternoon,70000,4
28,EMP00148,02/11/2024,R&D,Female,Manager,Mumbai,Present,10:17:00,17:43:00,7.433333,NaN,0.000000,Afternoon,70000,5

In [ ]:
df.isnull().sum()

Employee_ID               0
Date                      0
Department                0
Gender                    0
Job_Role                  0
Location                  0
Status                    0
CheckIn                8452
CheckOut               8452
Work_Hours                0
Leave_Type            46535
Overtime_Hours            0
Shift                     0
Base_Salary               0
Performance_Rating        0
dtype: int64

#### Count of employee with City

In [ ]:
print(df.groupby('Location')['Employee_ID'].count())

Location
Bangalore    7209
Chennai      7164
Delhi        7187
Hyderabad    7020
Kolkata      7084
Mumbai       7106
Pune         7230
Name: Employee_ID, dtype: int64

#### Count of employee by their Status

In [106]:
print(df.groupby('Status')['Employee_ID'].count())

Status
Absent             80
Half Day           24
On Leave           59
Present           570
Work From Home     67
Name: Employee_ID, dtype: int64

In [ ]:
# Count of Gender records

df.groupby('Gender')['Employee_ID'].count()

Gender
Female    16576
Male      16811
Other     16613
Name: Employee_ID, dtype: int64

In [20]:
df[df["Department"] == 'Finance'].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
0,EMP00075,01/13/2024,Finance,Other,Intern,Mumbai,Present,8:51:00,16:19:00,7.466667,NaN,0.000000,Night,15000,4
17,EMP00374,03/30/2024,Finance,Female,Executive,Bangalore,On Leave,NaN,NaN,0.000000,Paid Leave,0.000000,Morning,50000,2
55,EMP00350,01/15/2024,Finance,Female,Executive,Kolkata,Present,8:25:00,18:09:00,9.733333,NaN,0.733333,Afternoon,50000,2
64,EMP00142,02/23/2024,Finance,Female,Consultant,Delhi,Present,9:39:00,18:44:00,9.083333,NaN,0.083333,Night,65000,2
67,EMP00356,03/05/2024,Finance,Female,Consultant,Chennai,Absent,NaN,NaN,0.000000,NaN,0.000000,Afternoon,65000,2

#### Employees record after date 01/02/2024

In [33]:
df[df['Date'] > '02/01/2024'].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
1,EMP00411,02/26/2024,Support,Male,Executive,Bangalore,Present,8:45:00,16:57:00,8.200000,NaN,0.000000,Afternoon,50000,1
2,EMP00379,02/19/2024,Support,Male,Intern,Pune,Absent,NaN,NaN,0.000000,NaN,0.000000,Morning,15000,1
4,EMP00758,02/23/2024,Marketing,Male,Intern,Delhi,Present,10:02:00,18:47:00,8.750000,NaN,0.000000,Afternoon,15000,3
5,EMP00775,02/07/2024,Marketing,Male,Manager,Bangalore,Work From Home,8:35:00,19:13:00,10.633333,NaN,1.633333,Morning,70000,4
6,EMP00215,03/13/2024,Marketing,Female,Manager,Mumbai,Present,9:41:00,19:13:00,9.533333,NaN,0.533333,Night,70000,4

#### Female Employee records

In [37]:
df[df['Gender'] == 'Female'].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
6,EMP00215,03/13/2024,Marketing,Female,Manager,Mumbai,Present,9:41:00,19:13:00,9.533333,NaN,0.533333,Night,70000,4
12,EMP00180,03/28/2024,R&D,Female,Intern,Hyderabad,Present,9:48:00,17:21:00,7.550000,NaN,0.000000,Afternoon,15000,3
17,EMP00374,03/30/2024,Finance,Female,Executive,Bangalore,On Leave,NaN,NaN,0.000000,Paid Leave,0.000000,Morning,50000,2
21,EMP00385,01/21/2024,IT,Female,Intern,Pune,On Leave,NaN,NaN,0.000000,Sick Leave,0.000000,Afternoon,15000,1
22,EMP00094,03/03/2024,HR,Female,Intern,Hyderabad,Present,9:33:00,17:29:00,7.933333,NaN,0.000000,Afternoon,15000,4

#### On leave Employee and Work from employees

In [ ]:
df[(df['Status'] == 'On leave') & (df['Status'] == 'Work From Home')].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
5,EMP00775,02/07/2024,Marketing,Male,Manager,Bangalore,Work From Home,8:35:00,19:13:00,10.633333,NaN,1.633333,Morning,70000,4
10,EMP00089,03/10/2024,IT,Other,Developer,Mumbai,Work From Home,9:59:00,16:46:00,6.783333,NaN,0.000000,Afternoon,60000,1
18,EMP00582,01/09/2024,Operations,Male,Manager,Chennai,Work From Home,9:48:00,16:42:00,6.900000,NaN,0.000000,Morning,70000,3
24,EMP00117,02/15/2024,Operations,Other,Consultant,Bangalore,Work From Home,8:56:00,16:47:00,7.850000,NaN,0.000000,Night,65000,1
26,EMP00013,03/12/2024,Sales,Male,Intern,Hyderabad,Work From Home,10:15:00,18:37:00,8.366667,NaN,0.000000,Morning,15000,2

In [43]:
df[df['Status'] == 'On Leave'].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
8,EMP00261,01/14/2024,Marketing,Male,Developer,Hyderabad,On Leave,NaN,NaN,0.0,Paternity Leave,0.0,Afternoon,60000,2
17,EMP00374,03/30/2024,Finance,Female,Executive,Bangalore,On Leave,NaN,NaN,0.0,Paid Leave,0.0,Morning,50000,2
21,EMP00385,01/21/2024,IT,Female,Intern,Pune,On Leave,NaN,NaN,0.0,Sick Leave,0.0,Afternoon,15000,1
27,EMP00490,02/28/2024,Sales,Other,Analyst,Kolkata,On Leave,NaN,NaN,0.0,Paternity Leave,0.0,Afternoon,40000,4
31,EMP00014,01/14/2024,Support,Other,Manager,Pune,On Leave,NaN,NaN,0.0,Casual Leave,0.0,Afternoon,70000,2

In [44]:
df[df['Status'] == 'Work From Home'].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
5,EMP00775,02/07/2024,Marketing,Male,Manager,Bangalore,Work From Home,8:35:00,19:13:00,10.633333,NaN,1.633333,Morning,70000,4
10,EMP00089,03/10/2024,IT,Other,Developer,Mumbai,Work From Home,9:59:00,16:46:00,6.783333,NaN,0.000000,Afternoon,60000,1
18,EMP00582,01/09/2024,Operations,Male,Manager,Chennai,Work From Home,9:48:00,16:42:00,6.900000,NaN,0.000000,Morning,70000,3
24,EMP00117,02/15/2024,Operations,Other,Consultant,Bangalore,Work From Home,8:56:00,16:47:00,7.850000,NaN,0.000000,Night,65000,1
26,EMP00013,03/12/2024,Sales,Male,Intern,Hyderabad,Work From Home,10:15:00,18:37:00,8.366667,NaN,0.000000,Morning,15000,2

#### Highest Salary record

In [ ]:
df.sort_values(by='Base_Salary', ascending=False).head() # Top 5 records

df.nlargest(2, 'Base_Salary')  # Highest 2 emp salaries record

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
5,EMP00775,02/07/2024,Marketing,Male,Manager,Bangalore,Work From Home,8:35:00,19:13:00,10.633333,NaN,1.633333,Morning,70000,4
6,EMP00215,03/13/2024,Marketing,Female,Manager,Mumbai,Present,9:41:00,19:13:00,9.533333,NaN,0.533333,Night,70000,4

#### Lower salary

In [ ]:
df.sort_values(by='Base_Salary', ascending = True).head() # Top 5 records of lower salary

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
49995,EMP00121,02/16/2024,IT,Other,Intern,Hyderabad,Present,9:10:00,16:30:00,7.333333,NaN,0.0,Night,15000,2
49962,EMP00183,01/01/2024,Marketing,Female,Intern,Kolkata,Present,10:28:00,16:57:00,6.483333,NaN,0.0,Morning,15000,4
49964,EMP00384,01/01/2024,HR,Male,Intern,Pune,Work From Home,9:27:00,18:12:00,8.750000,NaN,0.0,Night,15000,3
57,EMP00555,03/16/2024,Operations,Other,Intern,Mumbai,On Leave,NaN,NaN,0.000000,Sick Leave,0.0,Night,15000,4
63,EMP00297,03/08/2024,IT,Male,Intern,Bangalore,Present,8:27:00,16:55:00,8.466667,NaN,0.0,Night,15000,4

In [61]:
df.nsmallest(1, 'Base_Salary')[['Department', 'Base_Salary', 'Job_Role']]

  Department  Base_Salary Job_Role
0    Finance        15000   Intern

#### Higest salary with department

In [12]:
row = df.loc[df['Base_Salary'].idxmax()] # idxmax() is used to find max index number , 
                                         # loc is used for fetching entire row
dept = row['Department']                 # Extract the department name
salary = row['Base_Salary']              # Extract Base Salary

print(dept, salary)

Marketing 70000

In [13]:
df.loc[df['Base_Salary'].idxmax(), ['Department', 'Base_Salary']]

Department     Marketing
Base_Salary        70000
Name: 5, dtype: object

In [16]:
df.nlargest(1, 'Base_Salary')[['Department', 'Base_Salary']]

  Department  Base_Salary
5  Marketing        70000

#### Highest Performance employee

In [ ]:
# Top 5 Highest performance rating employee

df.nlargest(5, 'Performance_Rating')[['Employee_ID', 'Performance_Rating']]

   Employee_ID  Performance_Rating
23    EMP00741                   5
28    EMP00148                   5
36    EMP00040                   5
47    EMP00055                   5
53    EMP00613                   5

#### Missing and Null value

In [63]:
df.isnull().sum()

Employee_ID               0
Date                      0
Department                0
Gender                    0
Job_Role                  0
Location                  0
Status                    0
CheckIn                8452
CheckOut               8452
Work_Hours                0
Leave_Type            46535
Overtime_Hours            0
Shift                     0
Base_Salary               0
Performance_Rating        0
dtype: int64

In [69]:
df['CheckIn'] = pd.to_numeric(df['CheckIn'], errors='coerce')
df['CheckIn'].fillna(df['CheckIn'].mean(), inplace=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_1960\1989604850.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['CheckIn'].fillna(df['CheckIn'].mean(), inplace=True)

In [70]:
print(df['CheckIn'].head(10))
print(df['CheckIn'].dtype)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
8   NaN
9   NaN
Name: CheckIn, dtype: float64
float64

In [83]:
# Fill missing CheckIn/CheckOut with forward fill
df['CheckIn'] = df['CheckIn'].fillna(method='ffill')
df['CheckOut'] = df['CheckOut'].fillna(method='ffill')

# Fill missing Leave_Type with default category
df['Leave_Type'] = df['Leave_Type'].fillna("No Leave")

# Save cleaned file
cleaned_path = "employees_attendance_leave_tracker_cleaned.csv"
df.to_csv(cleaned_path, index=False)

cleaned_path

C:\Users\hp\AppData\Local\Temp\ipykernel_1960\2841486784.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['CheckIn'] = df['CheckIn'].fillna(method='ffill')
C:\Users\hp\AppData\Local\Temp\ipykernel_1960\2841486784.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['CheckOut'] = df['CheckOut'].fillna(method='ffill')

'employees_attendance_leave_tracker_cleaned.csv'

In [73]:
df['CheckOut'] = pd.to_numeric(df['CheckOut'], errors='coerce')
df['CheckOut'].fillna(df['CheckOut'].mean(), inplace=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_1960\2230738708.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['CheckOut'].fillna(df['CheckOut'].mean(), inplace=True)

In [78]:
df['CheckOut'].fillna(df['CheckOut'].mean(), inplace=True)

In [74]:
df['Leave_Type']= df['Leave_Type'].fillna(df['Leave_Type'].mode()[0])

In [80]:
df.to_csv("employee_attendance_leave_tracker_cleaned.csv",index=False)

In [ ]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [Employee_ID, Date, Department, Gender, Job_Role, Location, Status, CheckIn, CheckOut, Work_Hours, Leave_Type, Overtime_Hours, Shift, Base_Salary, Performance_Rating]
Index: []

In [94]:
df['Employee_ID'].value_counts()[df['Employee_ID'].value_counts() > 1]

Employee_ID
EMP00598    76
EMP00310    73
EMP00782    73
EMP00403    73
EMP00668    73
            ..
EMP00424    50
EMP00723    50
EMP00283    50
EMP00481    49
EMP00004    48
Name: count, Length: 800, dtype: int64

In [96]:
df = pd.read_csv("employee_attendance_leave_tracker_cleaneddata.csv")

In [ ]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [Employee_ID, Date, Department, Gender, Job_Role, Location, Status, CheckIn, CheckOut, Work_Hours, Leave_Type, Overtime_Hours, Shift, Base_Salary, Performance_Rating]
Index: []

In [99]:
df[df.duplicated(subset=['Employee_ID'])].head()

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
35,EMP00055,03/09/2024,IT,Female,Intern,Pune,Absent,9:48:00,17:53:00,0.000000,No Leave,0.0,Morning,15000,3
39,EMP00582,01/27/2024,R&D,Male,Intern,Bangalore,Work From Home,9:31:00,19:25:00,9.900000,No Leave,0.9,Afternoon,15000,3
47,EMP00055,02/12/2024,HR,Male,Executive,Delhi,Present,8:49:00,17:42:00,8.883333,No Leave,0.0,Afternoon,50000,5
48,EMP00180,01/23/2024,R&D,Other,Intern,Bangalore,On Leave,8:49:00,17:42:00,0.000000,Sick Leave,0.0,Afternoon,15000,2
71,EMP00715,01/16/2024,Finance,Female,Manager,Chennai,Present,10:07:00,18:22:00,8.250000,No Leave,0.0,Morning,70000,1

In [100]:
df = df.drop_duplicates(subset=["Employee_ID"], keep="first")

In [101]:
print(df.duplicated().sum())

0

In [102]:
df

,Employee_ID,Date,Department,Gender,Job_Role,Location,Status,CheckIn,CheckOut,Work_Hours,Leave_Type,Overtime_Hours,Shift,Base_Salary,Performance_Rating
0,EMP00075,01/13/2024,Finance,Other,Intern,Mumbai,Present,8:51:00,16:19:00,7.466667,No Leave,0.000000,Night,15000,4
1,EMP00411,02/26/2024,Support,Male,Executive,Bangalore,Present,8:45:00,16:57:00,8.200000,No Leave,0.000000,Afternoon,50000,1
2,EMP00379,02/19/2024,Support,Male,Intern,Pune,Absent,8:45:00,16:57:00,0.000000,No Leave,0.000000,Morning,15000,1
3,EMP00673,01/01/2024,HR,Other,Consultant,Chennai,Present,10:03:00,17:09:00,7.100000,No Leave,0.000000,Morning,65000,3
4,EMP00758,02/23/2024,Marketing,Male,Intern,Delhi,Present,10:02:00,18:47:00,8.750000,No Leave,0.000000,Afternoon,15000,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4158,EMP00050,01/13/2024,R&D,Other,Manager,Hyderabad,Present,9:05:00,17:03:00,7.966667,No Leave,0.000000,Morning,70000,2
4301,EMP00354,01/12/2024,Marketing,Male,Intern,Mumbai,Present,8:34:00,19:08:00,10.566667,No Leave,1.566667,Afternoon,15000,5
4315,EMP00063,02/24/2024,Marketing,Other,Manager,Kolkata,Present,9:35:00,19:06:00,9.516667,No Leave,0.516667,Morning,70000,5
4619,EMP00076,03/28/2024,HR,Male,Intern,Mumbai,Present,9:26:00,16:54:00,7.466667,No Leave,0.000000,Afternoon,15000,4
4929,EMP00394,02/05/2024,HR,Female,Executive,Kolkata,Present,8:22:00,16:42:00,8.333333,No Leave,0.000000,Night,50000,1

In [104]:
df.to_csv("employees_attendance_leave_tracker_cleaneddata.csv", index=False)